[Killed] Equality mutation
Gol.Application/Models/Game.cs:3:21
 using CSharpFunctionalExtensions;
 
-namespace Gol.Application.Tests
+namespace Gol.Applicx > 0 Tests
 {
     public class Game

[Killed] Equality mutation
Gol.Application/Models/Game.cs:3:29
 using CSharpFunctionalExtensions;
 
-namespace Gol.Application.Tests
+namespace Gol.Application.Tey > 0 
 {
     public class Game

[Killed] Equality mutation
Gol.Application/Models/Game.cs:4:25
 using CSharpFunctionalExtensions;
 
 namespace Gol.Application.Tests
-{
+{cells[x, y] != CellType.Alive
     public class Game
     {

[Killed] Negate expression
Gol.Application/Models/Game.cs:4:25
 using CSharpFunctionalExtensions;
 
 namespace Gol.Application.Tests
-{
+{!(cells[x, y] == CellType.Alive)
     public class Game
     {

[Killed] Equality mutation
Gol.Application/Models/Game.cs:5:45
 
 namespace Gol.Application.Tests
 {
-    public class Game
+    public class Gamey > cellY + 1
     {
         public Game(int generation, int width, int height, CellType[,] cells)

[Killed] Arithmetic mutation
Gol.Application/Models/Game.cs:5:50
 
 namespace Gol.Application.Tests
 {
-    public class Game
+    public class GamecellY - 1
     {
         public Game(int generation, int width, int height, CellType[,] cells)

[Killed] Equality mutation
Gol.Application/Models/Game.cs:6:29
 namespace Gol.Application.Tests
 {
     public class Game
-    {
+    {aliveNeighbours > 2 
         public Game(int generation, int width, int height, CellType[,] cells)
         {

[Killed] Equality mutation
Gol.Application/Models/Game.cs:6:29
 namespace Gol.Application.Tests
 {
     public class Game
-    {
+    {aliveNeighbours <= 2 
         public Game(int generation, int width, int height, CellType[,] cells)
         {

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Gol.Application/Models/Game.cs:7:33
 {
     public class Game
     {
-        public Game(int generation, int width, int height, CellType[,] cells)
+        public Game(int generati                                aliveNeighbours--t height, CellType[,] cells)
         {
             Generation = generation;

[Killed] Equality mutation
Gol.Application/Models/Game.cs:15:25
             this.cells = cells;
         }
 
-        public int Generation { get; }
+        public int Genercells[x, y] != CellType.Dead
         public int Width { get; }
         public int Height { get; }

[Killed] Negate expression
Gol.Application/Models/Game.cs:15:25
             this.cells = cells;
         }
 
-        public int Generation { get; }
+        public int Gener!(cells[x, y] == CellType.Dead)
         public int Width { get; }
         public int Height { get; }

[Killed] Equality mutation
Gol.Application/Models/Game.cs:17:29
 
         public int Generation { get; }
         public int Width { get; }
-        public int Height { get; }
+        public int Height { aliveNeighbours != 3
         private readonly CellType[,] cells;
 

[Killed] Negate expression
Gol.Application/Models/Game.cs:17:29
 
         public int Generation { get; }
         public int Width { get; }
-        public int Height { get; }
+        public int Height { !(aliveNeighbours == 3)
         private readonly CellType[,] cells;
 

[Killed] Equality mutation
Gol.Application/Models/Game.cs:27:17
 
         public Result IsValid()
         {
-            if (Generation < 1) return Result.Failure("Generation above 1 expected. Found: " + Generation);
+            if (Generation > 1) return Result.Failure("Generation above 1 expected. Found: " + Generation);
             foreach (var cellType in cells)
             {

[Killed] Negate expression
Gol.Application/Models/Game.cs:27:17
 
         public Result IsValid()
         {
-            if (Generation < 1) return Result.Failure("Generation above 1 expected. Found: " + Generation);
+            if (!(Generation < 1)) return Result.Failure("Generation above 1 expected. Found: " + Generation);
             foreach (var cellType in cells)
             {

[Killed] Negate expression
Gol.Application/Models/Game.cs:30:21
             if (Generation < 1) return Result.Failure("Generation above 1 expected. Found: " + Generation);
             foreach (var cellType in cells)
             {
-                if (cellType == CellType.Unknown) return Result.Failure("Wrong CellType found: " + cellType);
+                if (!(cellType == CellType.Unknown)) return Result.Failure("Wrong CellType found: " + cellType);
             }
             return Result.Success();

[Killed] Equality mutation
Gol.Application/Models/Game.cs:30:21
             if (Generation < 1) return Result.Failure("Generation above 1 expected. Found: " + Generation);
             foreach (var cellType in cells)
             {
-                if (cellType == CellType.Unknown) return Result.Failure("Wrong CellType found: " + cellType);
+                if (cellType != CellType.Unknown) return Result.Failure("Wrong CellType found: " + cellType);
             }
             return Result.Success();

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Gol.Application/Models/Game.cs:38:40
         public Game GenerateNextGeneration()
         {
             var newCells = new CellType[Width, Height];
-            for (int x = 0; x < Width; x++)
+            for (int x = 0; x < Width; x--)
             {
                 for (int y = 0; y < Height; y++)

[Killed] Equality mutation
Gol.Application/Models/Game.cs:38:29
         public Game GenerateNextGeneration()
         {
             var newCells = new CellType[Width, Height];
-            for (int x = 0; x < Width; x++)
+            for (int x = 0; x <= Width; x++)
             {
                 for (int y = 0; y < Height; y++)

[Killed] Arithmetic mutation
Gol.Application/Models/Game.cs:67:29
                     }
                 }
             }
-            return new Game(Generation + 1, Width, Height, newCells);
+            return new Game(Generation - 1, Width, Height, newCells);
         }
 

[Killed] Equality mutation
Gol.Application/Models/Game.cs:73:37
         private int CountAliveNeighbours(int cellX, int cellY)
         {
             var aliveNeighbours = 0;
-            for (int x = cellX - 1; x <= cellX + 1; x++)
+            for (int x = cellX - 1; x < cellX + 1; x++)
             {
                 if (x >= 0 && x < Width)

[Killed] Equality mutation
Gol.Application/Models/Game.cs:73:37
         private int CountAliveNeighbours(int cellX, int cellY)
         {
             var aliveNeighbours = 0;
-            for (int x = cellX - 1; x <= cellX + 1; x++)
+            for (int x = cellX - 1; x > cellX + 1; x++)
             {
                 if (x >= 0 && x < Width)
