[NoCoverage] Equality mutation
Gol.Application/Services/LinePrinter.cs:3:33
 using Gol.Application.Tests;
 using System.Text;
-
+x <= game.Width
 namespace Gol.Application.Services
 {

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
Gol.Application/Services/LinePrinter.cs:3:49
 using Gol.Application.Tests;
 using System.Text;
-
+x--
 namespace Gol.Application.Services
 {

[NoCoverage] String mutation
Gol.Application/Services/LinePrinter.cs:12:38
         {
             var stringBuilder = new StringBuilder();
 
-            stringBuilder.AppendLine($"Generation {game.Generation}:");
+            stringBuilder.AppendLine($"");
             stringBuilder.AppendLine($"{game.Height} {game.Width}");
             for (int y = 0; y < game.Height; y++)

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
Gol.Application/Services/LinePrinter.cs:14:46
 
             stringBuilder.AppendLine($"Generation {game.Generation}:");
             stringBuilder.AppendLine($"{game.Height} {game.Width}");
-            for (int y = 0; y < game.Height; y++)
+            for (int y = 0; y < game.Height; y--)
             {
                 for (int x = 0; x < game.Width; x++)

[NoCoverage] Equality mutation
Gol.Application/Services/LinePrinter.cs:14:29
 
             stringBuilder.AppendLine($"Generation {game.Generation}:");
             stringBuilder.AppendLine($"{game.Height} {game.Width}");
-            for (int y = 0; y < game.Height; y++)
+            for (int y = 0; y <= game.Height; y++)
             {
                 for (int x = 0; x < game.Width; x++)
