[Killed] PostIncrementExpression to PostDecrementExpression mutation
Gol.Application/Services/Parser.cs:3:45
 using CSharpFunctionalExtensions;
 using System;
-using System.Text.RegularExpressions;
+using System.Text.RegularExpressions;y--
 
 namespace Gol.Application.Tests

[Killed] Arithmetic mutation
Gol.Application/Services/Parser.cs:3:48
 using CSharpFunctionalExtensions;
 using System;
-using System.Text.RegularExpressions;
+using System.Text.RegularExpressions;y - 2
 
 namespace Gol.Application.Tests

[Killed] Equality mutation
Gol.Application/Services/Parser.cs:5:21
 using System;
 using System.Text.RegularExpressions;
 
-namespace Gol.Application.Tests
+namespace Gol.ApplicactualWidth == width
 {
     public class Parser

[Killed] Negate expression
Gol.Application/Services/Parser.cs:5:21
 using System;
 using System.Text.RegularExpressions;
 
-namespace Gol.Application.Tests
+namespace Gol.Applic!(actualWidth != width)
 {
     public class Parser

[Killed] Arithmetic mutation
Gol.Application/Services/Parser.cs:7:71
 
 namespace Gol.Application.Tests
 {
-    public class Parser
+    public class Parseri+2
     {
         private readonly string[] fileContent;

[Killed] String mutation
Gol.Application/Services/Parser.cs:7:60
 
 namespace Gol.Application.Tests
 {
-    public class Parser
+    public class Parser$""
     {
         private readonly string[] fileContent;

[Killed] Negate expression
Gol.Application/Services/Parser.cs:19:17
         public Result<Game> ParseGame()
         {
             var generationResult = GetGeneration();
-            if (generationResult.IsFailure)
+            if (!(generationResult.IsFailure))
             {
                 return generationResult.ConvertFailure<Game>();

[Killed] Negate expression
Gol.Application/Services/Parser.cs:26:17
             var generation = generationResult.Value;
 
             var widthResult = GetWidth();
-            if (widthResult.IsFailure)
+            if (!(widthResult.IsFailure))
             {
                 return widthResult.ConvertFailure<Game>();

[Killed] Negate expression
Gol.Application/Services/Parser.cs:33:17
             var width = widthResult.Value;
 
             var heightResult = GetHeigth();
-            if (heightResult.IsFailure)
+            if (!(heightResult.IsFailure))
             {
                 return heightResult.ConvertFailure<Game>();

[Killed] Negate expression
Gol.Application/Services/Parser.cs:40:17
             var height = heightResult.Value;
 
             var cellsResult = GetCells(width, height);
-            if (cellsResult.IsFailure)
+            if (!(cellsResult.IsFailure))
             {
                 return cellsResult.ConvertFailure<Game>();

[Killed] Equality mutation
Gol.Application/Services/Parser.cs:52:29
         private Result<CellType[,]> GetCells(int width, int height)
         {
             var cells = new CellType[width, height];
-            for (int x = 0; x < width; x++)
+            for (int x = 0; x <= width; x++)
             {
                 for (int y = 0; y < height; y++)

[Killed] Equality mutation
Gol.Application/Services/Parser.cs:52:29
         private Result<CellType[,]> GetCells(int width, int height)
         {
             var cells = new CellType[width, height];
-            for (int x = 0; x < width; x++)
+            for (int x = 0; x > width; x++)
             {
                 for (int y = 0; y < height; y++)

[Killed] String mutation
Gol.Application/Services/Parser.cs:83:63
 
         private Result<int> GetWidth()
         {
-            var generationMatch = Regex.Match(fileContent[1], @"(\d) (\d)");
+            var generationMatch = Regex.Match(fileContent[1], "");
             var widthString = generationMatch.Groups[2].Value;
             var width = int.Parse(widthString);

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Gol.Application/Services/Parser.cs:87:53
             var widthString = generationMatch.Groups[2].Value;
             var width = int.Parse(widthString);
 
-            for (int i = 2; i < fileContent.Length; i++)
+            for (int i = 2; i < fileContent.Length; i--)
             {
                 var actualWidth = fileContent[i].Length;

[Killed] Equality mutation
Gol.Application/Services/Parser.cs:87:29
             var widthString = generationMatch.Groups[2].Value;
             var width = int.Parse(widthString);
 
-            for (int i = 2; i < fileContent.Length; i++)
+            for (int i = 2; i <= fileContent.Length; i++)
             {
                 var actualWidth = fileContent[i].Length;

[Killed] Arithmetic mutation
Gol.Application/Services/Parser.cs:104:32
             var heightString = generationMatch.Groups[1].Value;
             var height = int.Parse(heightString);
 
-            var actualheight = fileContent.Length - 2;
+            var actualheight = fileContent.Length + 2;
             if (actualheight != height)
             {

[Killed] Negate expression
Gol.Application/Services/Parser.cs:105:17
             var height = int.Parse(heightString);
 
             var actualheight = fileContent.Length - 2;
-            if (actualheight != height)
+            if (!(actualheight != height))
             {
                 return Result.Failure<int>($"Wrong height: {actualheight} found, but {height} expected");

[Killed] Equality mutation
Gol.Application/Services/Parser.cs:105:17
             var height = int.Parse(heightString);
 
             var actualheight = fileContent.Length - 2;
-            if (actualheight != height)
+            if (actualheight == height)
             {
                 return Result.Failure<int>($"Wrong height: {actualheight} found, but {height} expected");

[Killed] String mutation
Gol.Application/Services/Parser.cs:107:44
             var actualheight = fileContent.Length - 2;
             if (actualheight != height)
             {
-                return Result.Failure<int>($"Wrong height: {actualheight} found, but {height} expected");
+                return Result.Failure<int>($"");
             }
             return Result.Success(height);

[Killed] Negate expression
Gol.Application/Services/Parser.cs:114:17
 
         private Result<int> GetGeneration()
         {
-            if (fileContent.Length == 0)
+            if (!(fileContent.Length == 0))
             {
                 return Result.Failure<int>("No Generationline found");

[Killed] Equality mutation
Gol.Application/Services/Parser.cs:114:17
 
         private Result<int> GetGeneration()
         {
-            if (fileContent.Length == 0)
+            if (fileContent.Length != 0)
             {
                 return Result.Failure<int>("No Generationline found");

[Killed] String mutation
Gol.Application/Services/Parser.cs:118:63
             {
                 return Result.Failure<int>("No Generationline found");
             }
-            var generationMatch = Regex.Match(fileContent[0], @"Generation (\d*):");
+            var generationMatch = Regex.Match(fileContent[0], "");
             if (!generationMatch.Success)
             {

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Gol.Application/Services/Parser.cs:119:17
                 return Result.Failure<int>("No Generationline found");
             }
             var generationMatch = Regex.Match(fileContent[0], @"Generation (\d*):");
-            if (!generationMatch.Success)
+            if (generationMatch.Success)
             {
                 return Result.Failure<int>("Generation not found");

[Killed] Negate expression
Gol.Application/Services/Parser.cs:119:17
                 return Result.Failure<int>("No Generationline found");
             }
             var generationMatch = Regex.Match(fileContent[0], @"Generation (\d*):");
-            if (!generationMatch.Success)
+            if (!(!generationMatch.Success))
             {
                 return Result.Failure<int>("Generation not found");

[Killed] Equality mutation
Gol.Application/Services/Parser.cs:125:17
             }
             var generationString = generationMatch.Groups[1].Value;
             var generation = int.Parse(generationString);
-            if (generation < 1)
+            if (generation > 1)
             {
                 return Result.Failure<int>("Generation must be 1 or higher");

[Killed] Negate expression
Gol.Application/Services/Parser.cs:125:17
             }
             var generationString = generationMatch.Groups[1].Value;
             var generation = int.Parse(generationString);
-            if (generation < 1)
+            if (!(generation < 1))
             {
                 return Result.Failure<int>("Generation must be 1 or higher");
